/**
 * 
 *         
 * 
 * Бензин (гибрид) Дизель (гибрид)
 * 
 * Подключаемый полный
 */

export default {
    // Кузов
    "offroad3": "Внедорожник 3 дв.",
    "offroad5": "Внедорожник 5 дв.",
    "cabriolet": "Кабриолет",
    "coupe": "Купе",
    "passvan": "Легковой фургон",
    "limousine": "Лимузин",
    "liftback": "Лифтбек",
    // "buscargopass": "Микроавтобус грузопасажирский",
    // "buspass": "Микроатобус пассажирский",
    "minivan": "Минивэн",
    "pickup": "Пикап",
    "rodster": "Родстер",
    "sedan": "Седан",
    "universal": "Универсал",
    "hatchback3": "Хэтчбек 3 дв.",
    "hatchback5": "Хэтчбек 5 дв.",
    "other": "Другой",

    // Коробка передач
    "automatic": "Автомат",
    "manual": "Механика",
    "robot": "Робот",
    "variator": "Вариатор",

    // Двигатель
    "gasoline": "Бензин",
    "propane-butane": "Бензин (пропан-бутан)",
    "methane": "Бензин (метан)",
    "gasoline-hybrid": "Бензин (гибрид)",
    "diesel": "Дизель",
    "diesel-hybrid": "Дизель (гибрид)",
    "electro": "Электро",

    // Привод
    "rear-wheel": "Задний",
    "front-wheel": "Передний",
    "plug-in-all-wheel": "Подключаемый полный",
    "all-wheel": "Постоянный полный",

    // Состояние
    "with-mileage": "С пробегом",
    "emergency-condition": "Аварийный",
    "for-parts": "На запчасти",

    // Цвет
    "white": "⚪️ Белый",
    "purple": "🍷 Бордовый",
    "yellow": "🟡 Жёлтый",
    "green": "🟢 Зелёный",
    "brown": "🟤 Коричневый",
    "red":"🔴 Красный",
    "orange": "🟠 Оранжевый",
    "silver": "🥈 Серебристый",
    "grey": "🔘 Серый",
    "blue": "🔵 Синий",
    "violet": "🟣 Фиолетовый",
    "black": "⚫️ Чёрный",
    "light": "☀️ Светлый",
    "dark": "🌑 Тёмный",
    "combo-color": "🌗 Комби",

    // Материал салона
    "natural-leather": "Натуральная кожа",
    "artificial-leather": "Искусственная кожа",
    "cloth": "Ткань",
    "velour": "Велюр",
    "alcantara": "Алькантара",
    "combo-material": "Комбинированные материалы",

    // Обмен
    "yes": "Да",
    "no": "Нет",
} as Record<string, string>